Revit 2026 API

# IExportContextOnInstanceBegin Method

---

This method marks the start of processing of an instance node (e.g. a family instance).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
RenderNodeAction OnInstanceBegin(
	InstanceNode node
)
```
```vb
Function OnInstanceBegin (
	node As InstanceNode
) As RenderNodeAction
```
```cpp
RenderNodeAction OnInstanceBegin(
	InstanceNode^ node
)
```
```fsharp
abstract OnInstanceBegin :
        node : InstanceNode -> RenderNodeAction
```

#### Parameters

node InstanceNode

#### Return Value

RenderNodeAction Return RenderNodeAction.Skip if you wish to skip processing this family instance, or return RenderNodeAction.Proceed otherwise.

#### Reference

IExportContext Interface

Autodesk.Revit.DB Namespace